package android.example.androiddevelopment.repository

import android.example.androiddevelopment.model.Product

object ClothesRepository {

    val clothes = arrayListOf(

        Product(0,
            "18 199 ₽",
            "Rukka",
            "Куртка утепленная RUKKA VALLAINEN",
            "46/48, 48/50, 50/52, 52/54",
            "Утепленная куртка прямого силуэта выполнена из водоотталкивающего текстиля. Используя технологию A.W.S Active особое внимание уделяется функциональности и комфорту, которые подходят как для более активных занятий, так и для повседневного ношения. Водоотталкивающие свойства - 8000 мм, воздухопроницаемость - 5000 г/м2/24 ч. Детали: фиксированный капюшон регулируется кулиской, воротник-стойка, застежка на молнию с ветрозащитной планкой на липучках, пять карманов по бокам, функциональные молнии в боковых швах, внутренние трикотажные манжеты способствуют сохранению тепла, искусственный утеплитель.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACD336401_18485441_1_v1_2x.jpg"),

        Product(1,
            "22 999 ₽",
            "Luhta",
            "Куртка утепленная LUHTA HARVIO",
            "54, 56",
            "Куртка выполнена из текстиля с термостежкой. Водоотталкивающая обработка производится без соединений PFC. Модель прямого кроя. Детали: застежка на молнию и липучки, воротник-стойка с мягкой внутренней отделкой из флиса, съемный регулируемый капюшон, 1 внутренний и 4 внешних кармана, регулируемые манжеты на липучках, утеплитель из искусственных волокон, идентичный натуральному пуху по теплоизоляционным свойствам.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACD284601_18492043_1_v1_2x.jpg"),

        Product(2,
            "15 499 ₽",
            "Alpha Industries",
            "Куртка утепленная ALPHA MA-1 FLIGHT JACKET",
            "46/48, 48/50, 50/52",
            "Утепленная куртка-бомбер выполнена из плотного текстиля с искусственным наполнителем. Модель прямого силуэта. Детали: трикотажный воротник-стойка, манжеты и низ; застежка на молнии, боковые карманы.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACD427701_18474680_1_v1.jpg"),

        Product(3,
            "11 500 ₽",
            "Anchor",
            "Пиджак",
            "52/176, 54/176, 48/182, 50/182",
            "Данный товар является частью проекта Lamoda planet - специального раздела нашего каталога, где мы собрали экологичные, этичные, инклюзивные и благотворительные товары.",
            "https://a.lmcdn.ru/img600x866/M/P/MP002XM0922A_18433239_1_v1_2x.jpg"),

        Product(4,
            "11 500 ₽",
            "UNIQLO",
            "Пуховик ультралегкий, 3D-крой",
            "50, 54",
            "Ультралегкая пуховая куртка, 3D-крой. Изготовлена из натурального пуха премиального качества (Fill Power 640), который удерживает воздух, создавая превосходный теплоизоляционный эффект. Материал внешней стороны куртки обладает водоотталкивающими свойствами, а подкладка – антистатическим эффектом. 3D-крой в области плеч обеспечивает полную свободу движений. Куртка складывается в чехол, который идет в комплекте. Удобно брать с собой.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACD196301_18477424_1_v1_2x.jpg"),

        Product(5,
            "38 300 ₽",
            "Diesel",
            "Парка",
            "46/48, 48/50, 50/52, 52/54, 54/56",
            "Парка выполнена из ветро- и водонепроницаемого текстиля, синтепоновый утеплитель. Детали: прямой крой, застежка на молнию, ветрозащитный клапан на пуговицах, кулиска на талии, 6 внешних карманов, трикотажные манжеты, оторочка из искусственного меха не отстегивается.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACB754301_18410515_1_v1_2x.jpg"),

        Product(6,
            "29 900 ₽",
            "Sudar",
            "Костюм классический",
            "52/176, 52/182, 54/182",
            "Данный товар является частью проекта Lamoda planet - специального раздела нашего каталога, где мы собрали экологичные, этичные, инклюзивные и благотворительные товары.",
            "https://a.lmcdn.ru/img600x866/M/P/MP002XM08HOM_17636995_2_v1_2x.jpg"),

        Product(7,
            "25 990 ₽",
            "Sudar",
            "Костюм классический",
            "52/176, 46/182, 52/182, 54/182",
            "Данный товар является частью проекта Lamoda planet - специального раздела нашего каталога, где мы собрали экологичные, этичные, инклюзивные и благотворительные товары.",
            "https://a.lmcdn.ru/img600x866/M/P/MP002XM08HOK_17615063_1_v1_2x.jpg"),

        Product(8,
            "40 899 ₽",
            "EA7",
            "Куртка утепленная",
            "46/48, 48/50, 50/52, 52/54, 54/56",
            "Куртка от премиум-бренда выполнена из ветрозащитного текстиля. Утеплитель - синтепон. Модель прямого кроя. Особенности: застежка на молнии, ветрозащитный клапан на кнопках, воротник-стойка, несъемный капюшон, 2 накладных кармана, 2 нагрудных кармана, внутренний карман.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACA276301_18203210_1_v1_2x.jpg"),

        Product(9,
            "40 300 ₽",
            "Armani Exchange",
            "Пуховик",
            "46/48, 48/50, 50/52, 52/54",
            "Стеганый пуховик выполнен из текстиля. Модель прямого кроя с натуральным утеплителем из утиного пуха и пера. Особенности: воротник-стойка с потайным капюшоном, застежка на молнию, два боковых кармана и один карман внутри, эластичные манжеты и низ для защиты от ветра, гладкая подкладка.",
            "https://a.lmcdn.ru/img600x866/R/T/RTLABQ239701_17783937_1_v2_2x.jpg")

    )

}