package android.example.androiddevelopment.repository

import android.example.androiddevelopment.model.Product

object ShoesRepository {

    val shoes = arrayListOf(

        Product(0,
            "20 990 ₽",
            "Calvin Klein",
            "Ботинки",
            "40, 41, 42, 43, 44",
            "Материал верха\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Шерсть\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Сезон\n" +
                    "Демисезон\n" +
                    "\n" +
                    "Цвет\n" +
                    "Черный\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Португалия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLACC575001",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACC575001_18480718_1_v1_2x.jpg"),

        Product(1,
            "59 600 ₽",
            "Officine Creative",
            "Ботинки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Сезон\n" +
                    "Демисезон\n" +
                    "\n" +
                    "Цвет\n" +
                    "Черный\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Италия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Молния, шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLABM468401",
            "https://a.lmcdn.ru/img600x866/R/T/RTLABM468401_17403125_1_v1_2x.jpg"),

        Product(2,
            "23 000 ₽",
            "Aeronautica Militare",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Сезон\n" +
                    "Мульти\n" +
                    "\n" +
                    "Цвет\n" +
                    "Серый\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Португалия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLABZ540701",
            "https://a.lmcdn.ru/img600x866/R/T/RTLABZ540701_18171499_1_v1_2x.jpg"),

        Product(3,
            "19 200 ₽",
            "Trussardi",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Искусственная кожа, натуральная кожа, полиэстер\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Цвет\n" +
                    "Черный\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Китай\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLABY867301",
            "https://a.lmcdn.ru/img600x866/R/T/RTLABY867301_17988181_1_v1_2x.jpg"),

        Product(4,
            "12 700 ₽",
            "Armani Exchange",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Искусственная кожа, текстиль\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Сезон\n" +
                    "Демисезон\n" +
                    "\n" +
                    "Цвет\n" +
                    "Белый\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Лаосская Народно-Демократическая Республика\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLACB681001",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACB681001_18406092_1_v1_2x.jpg"),

        Product(5,
            "36 800 ₽",
            "Fabi",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Цвет\n" +
                    "Коричневый\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Италия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLACA747001",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACA747001_18283520_1_v2_2x.jpg"),

        Product(6,
            "91 120 ₽",
            "Philipp Plein",
            "Кеды",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Сезон\n" +
                    "Демисезон\n" +
                    "\n" +
                    "Цвет\n" +
                    "Черный\n" +
                    "\n" +
                    "Цвет фурнитуры\n" +
                    "Серебряный\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Италия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLACA047201",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACA047201_18082402_1_v1_2x.jpg"),

        Product(7,
            "58 000 ₽",
            "Etro",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Искусственный материал\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Сезон\n" +
                    "Мульти\n" +
                    "\n" +
                    "Цвет\n" +
                    "Мультиколор\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Италия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLABQ658101",
            "https://a.lmcdn.ru/img600x866/R/T/RTLABQ658101_17879228_1_v1_2x.jpg"),

        Product(8,
            "19 300 ₽",
            "Hugo",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Полиэстер\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Текстиль\n" +
                    "\n" +
                    "Цвет\n" +
                    "Черный\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Лаосская Народно-Демократическая Республика\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLACC967201",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACC967201_18436876_1_v1_2x.jpg"),

        Product(9,
            "50 900 ₽",
            "Officine Creative",
            "Кроссовки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Резина\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Натуральная кожа\n" +
                    "\n" +
                    "Сезон\n" +
                    "Демисезон\n" +
                    "\n" +
                    "Цвет\n" +
                    "Серый\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Италия\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLABM468201",
            "https://a.lmcdn.ru/img600x866/R/T/RTLABM468201_17403120_1_v1_2x.jpg"),

        Product(10,
            "24 700 ₽",
            "Jog Dog",
            "Ботинки",
            "39, 40, 41, 42, 43",
            "Материал верха\n" +
                    "Искусственная кожа, текстиль\n" +
                    "\n" +
                    "Внутренний материал\n" +
                    "Флис\n" +
                    "\n" +
                    "Материал подошвы\n" +
                    "Полимер\n" +
                    "\n" +
                    "Материал стельки\n" +
                    "Байка\n" +
                    "\n" +
                    "Цвет\n" +
                    "Черный\n" +
                    "\n" +
                    "Страна производства\n" +
                    "Албания\n" +
                    "\n" +
                    "Застежка\n" +
                    "Шнурки\n" +
                    "\n" +
                    "Артикул\n" +
                    "RTLACB838601",
            "https://a.lmcdn.ru/img600x866/R/T/RTLACB838601_18270154_1_v1_2x.jpg")
    )

}